In [1]:
import numpy as np
import pandas as pd

# GroupBy

By “group by” we are referring to a process involving one or more of the following steps:

>* **Splitting** the data into groups based on some criteria.
>* **Applying** a function to each group independently.
>* **Combining** the results into a data structure.

Out of these, the split step is the most straightforward. In fact, in many situations we may wish to split the data set into groups and do something with those groups. In the apply step, we might wish to do one of the following:

>* **Aggregation**: compute a summary statistic (or statistics) for each group. Some examples:
>>* Compute group sums or means.
>>* Compute group sizes / counts.

>* **Transformation**: perform some group-specific computations and return a like-indexed object. Some examples:

>>* Standardize data (zscore) within a group.
>>* Filling NAs within groups with a value derived from each group.

>* **Filtration**: discard some groups, according to a group-wise computation that evaluates True or False. Some examples:

>>* Discard data that belongs to groups with only a few members.
>>* Filter out data based on the group sum or mean.

Some combination of the above: GroupBy will examine the results of the apply step and try to return a sensibly combined result if it doesn’t fit into either of the above two categories.

https://pandas.pydata.org/docs/user_guide/groupby.html

In [2]:
# declare the employee_records dataframe
df = pd.DataFrame({
        'employee_name': ['Sam', 'Max', 'Tony', 'Sarah', 'Tania', 'David', 'Mark','Alice', 'Charles', 'Bob', 'Anna'],
        'employee_dept': ['Research','HR','Marketing','Sales', 'Finance', 'IT', 'HR', 'Marketing', 'IT', 'Finance','Sales'],
        'employee_id' : [10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009, 10010, 10011],
        'employee_salary' : [45034.88, 65343.45, 53423.27, 76422.34, 58753.00, 34323.44, 66544.60, 34354.66, 55234.96, 39078.60, 44567.88],
        'employee_hobby' : ['Traveling','Reading','Sports','Reading', 'Traveling', 'Sports', 'Sports', 'Gardening', 'Sports', 'Traveling','Reading']
    })
df

   employee_name employee_dept  employee_id  employee_salary employee_hobby
0            Sam      Research        10001         45034.88      Traveling
1            Max            HR        10002         65343.45        Reading
2           Tony     Marketing        10003         53423.27         Sports
3          Sarah         Sales        10004         76422.34        Reading
4          Tania       Finance        10005         58753.00      Traveling
5          David            IT        10006         34323.44         Sports
6           Mark            HR        10007         66544.60         Sports
7          Alice     Marketing        10008         34354.66      Gardening
8        Charles            IT        10009         55234.96         Sports
9            Bob       Finance        10010         39078.60      Traveling
10          Anna         Sales        10011         44567.88        Reading

In [3]:
# groupby a single column
df.groupby('employee_dept').groups

{'Finance': [4, 9], 'HR': [1, 6], 'IT': [5, 8], 'Marketing': [2, 7], 'Research': [0], 'Sales': [3, 10]}

In [4]:
# groupby using multiple columns
df_gb = df.groupby(['employee_dept','employee_hobby']).groups
df_gb

{('Finance', 'Traveling'): [4, 9], ('HR', 'Reading'): [1], ('HR', 'Sports'): [6], ('IT', 'Sports'): [5, 8], ('Marketing', 'Gardening'): [7], ('Marketing', 'Sports'): [2], ('Research', 'Traveling'): [0], ('Sales', 'Reading'): [3, 10]}

In [5]:
#print(df_gb)
from pprint import pprint
pprint(df_gb)

{('Finance', 'Traveling'): Int64Index([4, 9], dtype='int64'),
 ('HR', 'Reading'): Int64Index([1], dtype='int64'),
 ('HR', 'Sports'): Int64Index([6], dtype='int64'),
 ('IT', 'Sports'): Int64Index([5, 8], dtype='int64'),
 ('Marketing', 'Gardening'): Int64Index([7], dtype='int64'),
 ('Marketing', 'Sports'): Int64Index([2], dtype='int64'),
 ('Research', 'Traveling'): Int64Index([0], dtype='int64'),
 ('Sales', 'Reading'): Int64Index([3, 10], dtype='int64')}

In [6]:
df_gb[('Finance', 'Traveling')]

Int64Index([4, 9], dtype='int64')

In [7]:
df_gb = df.groupby('employee_dept')

In [8]:
df_gb.get_group('IT')

  employee_name employee_dept  employee_id  employee_salary employee_hobby
5         David            IT        10006         34323.44         Sports
8       Charles            IT        10009         55234.96         Sports

In [9]:
df_gb = df.groupby(['employee_dept','employee_hobby'])
df_gb.get_group(('Finance', 'Traveling'))

  employee_name employee_dept  employee_id  employee_salary employee_hobby
4         Tania       Finance        10005          58753.0      Traveling
9           Bob       Finance        10010          39078.6      Traveling

In [10]:
df

   employee_name employee_dept  employee_id  employee_salary employee_hobby
0            Sam      Research        10001         45034.88      Traveling
1            Max            HR        10002         65343.45        Reading
2           Tony     Marketing        10003         53423.27         Sports
3          Sarah         Sales        10004         76422.34        Reading
4          Tania       Finance        10005         58753.00      Traveling
5          David            IT        10006         34323.44         Sports
6           Mark            HR        10007         66544.60         Sports
7          Alice     Marketing        10008         34354.66      Gardening
8        Charles            IT        10009         55234.96         Sports
9            Bob       Finance        10010         39078.60      Traveling
10          Anna         Sales        10011         44567.88        Reading

In [11]:
df_gb = df.groupby('employee_dept')
df_gb

### Aggretations

In [12]:
# average salary per department
# using the groups created above 
df_gb['employee_salary'].agg(np.mean)

employee_dept
Finance      48915.800
HR           65944.025
IT           44779.200
Marketing    43888.965
Research     45034.880
Sales        60495.110
Name: employee_salary, dtype: float64

In [13]:
df_gb['employee_salary'].agg([np.mean, np.sum, np.std])

                    mean        sum           std
employee_dept
Finance        48915.800   97831.60  13911.901656
HR             65944.025  131888.05    849.341310
IT             44779.200   89558.40  14786.677597
Marketing      43888.965   87777.93  13483.543439
Research       45034.880   45034.88           NaN
Sales          60495.110  120990.22  22524.504677

In [14]:
# iterate through the values
name_vals = []
for name,group in df_gb:
  print(name)
  name_vals.append(name)
  # name_vals = [name_vals name] # MATLAB code
  print(group,'\n')
print(name_vals)

Finance
  employee_name employee_dept  employee_id  employee_salary employee_hobby
4         Tania       Finance        10005          58753.0      Traveling
9           Bob       Finance        10010          39078.6      Traveling

HR
  employee_name employee_dept  employee_id  employee_salary employee_hobby
1           Max            HR        10002         65343.45        Reading
6          Mark            HR        10007         66544.60         Sports

IT
  employee_name employee_dept  employee_id  employee_salary employee_hobby
5         David            IT        10006         34323.44         Sports
8       Charles            IT        10009         55234.96         Sports

Marketing
  employee_name employee_dept  employee_id  employee_salary employee_hobby
2          Tony     Marketing        10003         53423.27         Sports
7         Alice     Marketing        10008         34354.66      Gardening

Research
  employee_name employee_dept  employee_id  employee_salary employee_hobby
0           Sam      Research        10001         45034.88      Traveling

Sales
   employee_name employee_dept  employee_id  employee_salary employee_hobby
3          Sarah         Sales        10004         76422.34        Reading
10          Anna         Sales        10011         44567.88        Reading

['Finance', 'HR', 'IT', 'Marketing', 'Research', 'Sales']